// See https://aka.ms/new-console-template for more information

internal class Program
{
    static void Main(string[] args)
    {
        Console.WriteLine("Hello World!");
    }

    
    #region Задача1
    // 1. На входе дано три массива заполненных случайными числами. Написать метод
    // по подсчёту общего количества чётных чисел в массивах. (ref)
    

    #endregion
    #region Задача 2
    // 2. Написать метод, который проверяет является ли введнная строка почтовым
    // адрессом и возвращающий домен почты.(out)
    #endregion

    #region Задача 3
    // 3. Написать метод, который удаляет из строки заданный символ. Символ является
    // входным параметром-значением. Строка должна быть параметром-ссылкой и
    // результатом. (ref)
    #endregion

    #region Задача 4
    // 4. Написать метод выполняющий сложение парметов, если параметры одного типа
    // данных возвращать true и результат сложение, в противном случае false (out)
    #endregion

    #region Задача 5
    // 5. Пользователь вводит строку и разделитель. Написать метод возвращающий
    // наличие в строке разделителя, если разделитель есть вернуть строку разбитую
    // данным разделителем (out)
    #endregion

    #region Задача 6
    // 6. Написать метод возвращающий разность между найбольшим и наименьшим
    // значением из списка. Результат разности возращать через out, метод для поиска
    // минимального и максимального написать с использованием params
    #endregion

    #region Задача 7
    // 7. Написать метод который принимает строку, если строка содержит только 0 и 1
    // вернуть true, а 0 и 1 перевести в 10-ную систему счисления, в противном случае
    // false (out)
    #endregion

    #region Задача 8
    // 8. На входе метода набор 0 и 1 перевести в 16-ную систему счисления (params)
    #endregion
}

